/**
 * Created by edeity on 2018/3/5.
 */
import echarts from 'echarts/lib/echarts'
import dataTool from 'echarts/extension/dataTool'

export function getLineOption() {
    return {
        xAxis: {
            type: 'category',
            data: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
        },
        yAxis: {
            type: 'value'
        },
        series: [{
            data: [820, 932, 901, 934, 1290, 1330, 1320],
            type: 'line',
            smooth: true
        }]
    }
}

export function getBarOption() {
    return {
        title: {text: 'ECharts 入门示例'},
        tooltip: {},
        xAxis: {
            data: ["衬衫", "羊毛衫", "雪纺衫", "裤子", "高跟鞋", "袜子"]
        },
        yAxis: {},
        series: [{
            name: '销量',
            type: 'bar',
            data: [5, 20, 36, 10, 10, 20]
        }]
    }
}

export function getPieOption() {
    return {
        title: {
            text: '某站点用户访问来源',
            subtext: '纯属虚构',
            x: 'center'
        },
        tooltip: {
            trigger: 'item',
            formatter: "{a} <br/>{b} : {c} ({d}%)"
        },
        legend: {
            orient: 'vertical',
            left: 'left',
            data: ['直接访问', '邮件营销', '联盟广告', '视频广告', '搜索引擎']
        },
        series: [
            {
                name: '访问来源',
                type: 'pie',
                radius: '55%',
                center: ['50%', '60%'],
                data: [
                    {value: 335, name: '直接访问'},
                    {value: 310, name: '邮件营销'},
                    {value: 234, name: '联盟广告'},
                    {value: 135, name: '视频广告'},
                    {value: 1548, name: '搜索引擎'}
                ],
                itemStyle: {
                    emphasis: {
                        shadowBlur: 10,
                        shadowOffsetX: 0,
                        shadowColor: 'rgba(0, 0, 0, 0.5)'
                    }
                }
            }
        ]
    }
}

export function getRadarOption() {
    return {
        title: {
            text: '基础雷达图'
        },
        tooltip: {},
        legend: {
            data: ['预算分配（Allocated Budget）', '实际开销（Actual Spending）']
        },
        radar: {
            // shape: 'circle',
            name: {
                textStyle: {
                    color: '#fff',
                    backgroundColor: '#999',
                    borderRadius: 3,
                    padding: [3, 5]
                }
            },
            indicator: [
                {name: '销售（sales）', max: 6500},
                {name: '管理（Administration）', max: 16000},
                {name: '信息技术（Information Techology）', max: 30000},
                {name: '客服（Customer Support）', max: 38000},
                {name: '研发（Development）', max: 52000},
                {name: '市场（Marketing）', max: 25000}
            ]
        },
        series: [{
            name: '预算 vs 开销（Budget vs spending）',
            type: 'radar',
            // areaStyle: {normal: {}},
            data: [
                {
                    value: [4300, 10000, 28000, 35000, 50000, 19000],
                    name: '预算分配（Allocated Budget）'
                },
                {
                    value: [5000, 14000, 28000, 31000, 42000, 21000],
                    name: '实际开销（Actual Spending）'
                }
            ]
        }]
    }
}

export function getScatterOption() {
    return {
        xAxis: {},
        yAxis: {},
        series: [{
            symbolSize: 20,
            data: [
                [10.0, 8.04],
                [8.0, 6.95],
                [13.0, 7.58],
                [9.0, 8.81],
                [11.0, 8.33],
                [14.0, 9.96],
                [6.0, 7.24],
                [4.0, 4.26],
                [12.0, 10.84],
                [7.0, 4.82],
                [5.0, 5.68]
            ],
            type: 'scatter'
        }]
    }
}


export function getMapOption() {
    return {
        tooltip: {
            trigger: 'item',
            formatter: '{b}'
        },
        series: [
            {
                name: '中国',
                type: 'map',
                mapType: 'china',
                selectedMode: 'multiple',
                label: {
                    normal: {
                        show: true
                    },
                    emphasis: {
                        show: true
                    }
                },
                data: [
                    {name: '广东', selected: true}
                ]
            }
        ]
    }
}

export function getBoxplotOption() {
    var data = dataTool.prepareBoxplotData([
        [850, 740, 900, 1070, 930, 850, 950, 980, 980, 880, 1000, 980, 930, 650, 760, 810, 1000, 1000, 960, 960],
        [960, 940, 960, 940, 880, 800, 850, 880, 900, 840, 830, 790, 810, 880, 880, 830, 800, 790, 760, 800],
        [880, 880, 880, 860, 720, 720, 620, 860, 970, 950, 880, 910, 850, 870, 840, 840, 850, 840, 840, 840],
        [890, 810, 810, 820, 800, 770, 760, 740, 750, 760, 910, 920, 890, 860, 880, 720, 840, 850, 850, 780],
        [890, 840, 780, 810, 760, 810, 790, 810, 820, 850, 870, 870, 810, 740, 810, 940, 950, 800, 810, 870]
    ]);
    return {
        title: [
            {
                text: 'Michelson-Morley Experiment',
                left: 'center',
            },
            {
                text: 'upper: Q3 + 1.5 * IRQ \nlower: Q1 - 1.5 * IRQ',
                borderColor: '#999',
                borderWidth: 1,
                textStyle: {
                    fontSize: 14
                },
                left: '10%',
                top: '90%'
            }
        ],
        tooltip: {
            trigger: 'item',
            axisPointer: {
                type: 'shadow'
            }
        },
        grid: {
            left: '10%',
            right: '10%',
            bottom: '15%'
        },
        xAxis: {
            type: 'category',
            data: data.axisData,
            boundaryGap: true,
            nameGap: 30,
            splitArea: {
                show: false
            },
            axisLabel: {
                formatter: 'expr {value}'
            },
            splitLine: {
                show: false
            }
        },
        yAxis: {
            type: 'value',
            name: 'km/s minus 299,000',
            splitArea: {
                show: true
            }
        },
        series: [
            {
                name: 'boxplot',
                type: 'boxplot',
                data: data.boxData,
                tooltip: {
                    formatter: function (param) {
                        return [
                            'Experiment ' + param.name + ': ',
                            'upper: ' + param.data[5],
                            'Q3: ' + param.data[4],
                            'median: ' + param.data[3],
                            'Q1: ' + param.data[2],
                            'lower: ' + param.data[1]
                        ].join('<br/>')
                    }
                }
            },
            {
                name: 'outlier',
                type: 'scatter',
                data: data.outliers
            }
        ]
    };
}

export function getHeatMap() {
    var hours = ['12a', '1a', '2a', '3a', '4a', '5a', '6a',
        '7a', '8a', '9a', '10a', '11a',
        '12p', '1p', '2p', '3p', '4p', '5p',
        '6p', '7p', '8p', '9p', '10p', '11p'];
    var days = ['Saturday', 'Friday', 'Thursday',
        'Wednesday', 'Tuesday', 'Monday', 'Sunday'];

    var data = [[0, 0, 5], [0, 1, 1], [0, 2, 0], [0, 3, 0], [0, 4, 0], [0, 5, 0], [0, 6, 0], 
        [0, 7, 0], [0, 8, 0], [0, 9, 0], [0, 10, 0], [0, 11, 2], [0, 12, 4], [0, 13, 1], [0, 14, 1],
        [0, 15, 3], [0, 16, 4], [0, 17, 6], [0, 18, 4], [0, 19, 4], [0, 20, 3], [0, 21, 3], 
        [0, 22, 2], [0, 23, 5], [1, 0, 7], [1, 1, 0], [1, 2, 0], [1, 3, 0], [1, 4, 0], [1, 5, 0],
        [1, 6, 0], [1, 7, 0], [1, 8, 0], [1, 9, 0], [1, 10, 5], [1, 11, 2], [1, 12, 2], [1, 13, 6],
        [1, 14, 9], [1, 15, 11], [1, 16, 6], [1, 17, 7], [1, 18, 8], [1, 19, 12], [1, 20, 5], [1, 21, 5], 
        [1, 22, 7], [1, 23, 2], [2, 0, 1], [2, 1, 1], [2, 2, 0], [2, 3, 0], [2, 4, 0], [2, 5, 0],
        [2, 6, 0], [2, 7, 0], [2, 8, 0], [2, 9, 0], [2, 10, 3], [2, 11, 2], [2, 12, 1], [2, 13, 9], 
        [2, 14, 8], [2, 15, 10], [2, 16, 6], [2, 17, 5], [2, 18, 5], [2, 19, 5], [2, 20, 7], [2, 21, 4],
        [2, 22, 2], [2, 23, 4], [3, 0, 7], [3, 1, 3], [3, 2, 0], [3, 3, 0], [3, 4, 0], [3, 5, 0], 
        [3, 6, 0], [3, 7, 0], [3, 8, 1], [3, 9, 0], [3, 10, 5], [3, 11, 4], [3, 12, 7], [3, 13, 14], 
        [3, 14, 13], [3, 15, 12], [3, 16, 9], [3, 17, 5], [3, 18, 5], [3, 19, 10], [3, 20, 6], 
        [3, 21, 4], [3, 22, 4], [3, 23, 1], [4, 0, 1], [4, 1, 3], [4, 2, 0], [4, 3, 0], [4, 4, 0], 
        [4, 5, 1], [4, 6, 0], [4, 7, 0], [4, 8, 0], [4, 9, 2], [4, 10, 4], [4, 11, 4], [4, 12, 2], 
        [4, 13, 4], [4, 14, 4], [4, 15, 14], [4, 16, 12], [4, 17, 1], [4, 18, 8], [4, 19, 5], [4, 20, 3],
        [4, 21, 7], [4, 22, 3], [4, 23, 0], [5, 0, 2], [5, 1, 1], [5, 2, 0], [5, 3, 3], [5, 4, 0], 
        [5, 5, 0], [5, 6, 0], [5, 7, 0], [5, 8, 2], [5, 9, 0], [5, 10, 4], [5, 11, 1], [5, 12, 5], 
        [5, 13, 10], [5, 14, 5], [5, 15, 7], [5, 16, 11], [5, 17, 6], [5, 18, 0], [5, 19, 5], [5, 20, 3],
        [5, 21, 4], [5, 22, 2], [5, 23, 0], [6, 0, 1], [6, 1, 0], [6, 2, 0], [6, 3, 0], [6, 4, 0], 
        [6, 5, 0], [6, 6, 0], [6, 7, 0], [6, 8, 0], [6, 9, 0], [6, 10, 1], [6, 11, 0], [6, 12, 2],
        [6, 13, 1], [6, 14, 3], [6, 15, 4], [6, 16, 0], [6, 17, 0], [6, 18, 0], [6, 19, 0], [6, 20, 1], 
        [6, 21, 2], [6, 22, 2], [6, 23, 6]];

    data = data.map(function (item) {
        return [item[1], item[0], item[2] || '-'];
    });

    return {
        tooltip: {
            position: 'top'
        },
        animation: false,
        grid: {
            height: '50%',
            y: '10%'
        },
        xAxis: {
            type: 'category',
            data: hours,
            splitArea: {
                show: true
            }
        },
        yAxis: {
            type: 'category',
            data: days,
            splitArea: {
                show: true
            }
        },
        visualMap: {
            min: 0,
            max: 10,
            calculable: true,
            orient: 'horizontal',
            left: 'center',
            bottom: '15%'
        },
        series: [{
            name: 'Punch Card',
            type: 'heatmap',
            data: data,
            label: {
                normal: {
                    show: true
                }
            },
            itemStyle: {
                emphasis: {
                    shadowBlur: 10,
                    shadowColor: 'rgba(0, 0, 0, 0.5)'
                }
            }
        }]
    };
}

export function getTreeMap() {
    return {
        series: [{
            type: 'treemap',
            data: [{
                name: 'nodeA',            // First tree
                value: 10,
                children: [{
                    name: 'nodeAa',       // First leaf of first tree
                    value: 4
                }, {
                    name: 'nodeAb',       // Second leaf of first tree
                    value: 6
                }]
            }, {
                name: 'nodeB',            // Second tree
                value: 20,
                children: [{
                    name: 'nodeBa',       // Son of first tree
                    value: 20,
                    children: [{
                        name: 'nodeBa1',  // Granson of first tree
                        value: 20
                    }]
                }]
            }]
        }]
    }
}

export function getSunburstOption() {
    var data = [{
        name: 'Grandpa',
        children: [{
            name: 'Uncle Leo',
            value: 15,
            children: [{
                name: 'Cousin Jack',
                value: 2
            }, {
                name: 'Cousin Mary',
                value: 5,
                children: [{
                    name: 'Jackson',
                    value: 2
                }]
            }, {
                name: 'Cousin Ben',
                value: 4
            }]
        }, {
            name: 'Aunt Jane',
            children: [{
                name: 'Cousin Kate',
                value: 4
            }]
        }, {
            name: 'Father',
            value: 10,
            children: [{
                name: 'Me',
                value: 5,
                itemStyle: {
                    color: 'red'
                }
            }, {
                name: 'Brother Peter',
                value: 1
            }]
        }]
    }, {
        name: 'Mike',
        children: [{
            name: 'Uncle Dan',
            children: [{
                name: 'Cousin Lucy',
                value: 3
            }, {
                name: 'Cousin Luck',
                value: 4,
                children: [{
                    name: 'Nephew',
                    value: 2
                }]
            }]
        }]
    }, {
        name: 'Nancy',
        children: [{
            name: 'Uncle Nike',
            children: [{
                name: 'Cousin Betty',
                value: 1
            }, {
                name: 'Cousin Jenny',
                value: 2
            }]
        }]
    }];

    return {
        visualMap: {
            type: 'continuous',
            min: 0,
            max: 10,
            inRange: {
                color: ['#2D5F73', '#538EA6', '#F2D1B3', '#F2B8A2', '#F28C8C']
            }
        },
        series: {
            type: 'sunburst',
            data: data,
            radius: [0, '90%'],
            label: {
                rotate: 'radial'
            }
        }
    };

}

export function getParrallelOption() {
    // Schema:
// date,AQIindex,PM2.5,PM10,CO,NO2,SO2
    var dataBJ = [
        [1, 55, 9, 56, 0.46, 18, 6, "良"],
        [2, 25, 11, 21, 0.65, 34, 9, "优"],
        [3, 56, 7, 63, 0.3, 14, 5, "良"],
        [4, 33, 7, 29, 0.33, 16, 6, "优"],
        [5, 42, 24, 44, 0.76, 40, 16, "优"],
        [6, 82, 58, 90, 1.77, 68, 33, "良"],
        [7, 74, 49, 77, 1.46, 48, 27, "良"],
        [8, 78, 55, 80, 1.29, 59, 29, "良"],
        [9, 267, 216, 280, 4.8, 108, 64, "重度污染"],
        [10, 185, 127, 216, 2.52, 61, 27, "中度污染"],
        [11, 39, 19, 38, 0.57, 31, 15, "优"],
        [12, 41, 11, 40, 0.43, 21, 7, "优"],
        [13, 64, 38, 74, 1.04, 46, 22, "良"],
        [14, 108, 79, 120, 1.7, 75, 41, "轻度污染"],
        [15, 108, 63, 116, 1.48, 44, 26, "轻度污染"],
        [16, 33, 6, 29, 0.34, 13, 5, "优"],
        [17, 94, 66, 110, 1.54, 62, 31, "良"],
        [18, 186, 142, 192, 3.88, 93, 79, "中度污染"],
        [19, 57, 31, 54, 0.96, 32, 14, "良"],
        [20, 22, 8, 17, 0.48, 23, 10, "优"],
        [21, 39, 15, 36, 0.61, 29, 13, "优"],
        [22, 94, 69, 114, 2.08, 73, 39, "良"],
        [23, 99, 73, 110, 2.43, 76, 48, "良"],
        [24, 31, 12, 30, 0.5, 32, 16, "优"],
        [25, 42, 27, 43, 1, 53, 22, "优"],
        [26, 154, 117, 157, 3.05, 92, 58, "中度污染"],
        [27, 234, 185, 230, 4.09, 123, 69, "重度污染"],
        [28, 160, 120, 186, 2.77, 91, 50, "中度污染"],
        [29, 134, 96, 165, 2.76, 83, 41, "轻度污染"],
        [30, 52, 24, 60, 1.03, 50, 21, "良"],
        [31, 46, 5, 49, 0.28, 10, 6, "优"]
    ];

    var dataGZ = [
        [1, 26, 37, 27, 1.163, 27, 13, "优"],
        [2, 85, 62, 71, 1.195, 60, 8, "良"],
        [3, 78, 38, 74, 1.363, 37, 7, "良"],
        [4, 21, 21, 36, 0.634, 40, 9, "优"],
        [5, 41, 42, 46, 0.915, 81, 13, "优"],
        [6, 56, 52, 69, 1.067, 92, 16, "良"],
        [7, 64, 30, 28, 0.924, 51, 2, "良"],
        [8, 55, 48, 74, 1.236, 75, 26, "良"],
        [9, 76, 85, 113, 1.237, 114, 27, "良"],
        [10, 91, 81, 104, 1.041, 56, 40, "良"],
        [11, 84, 39, 60, 0.964, 25, 11, "良"],
        [12, 64, 51, 101, 0.862, 58, 23, "良"],
        [13, 70, 69, 120, 1.198, 65, 36, "良"],
        [14, 77, 105, 178, 2.549, 64, 16, "良"],
        [15, 109, 68, 87, 0.996, 74, 29, "轻度污染"],
        [16, 73, 68, 97, 0.905, 51, 34, "良"],
        [17, 54, 27, 47, 0.592, 53, 12, "良"],
        [18, 51, 61, 97, 0.811, 65, 19, "良"],
        [19, 91, 71, 121, 1.374, 43, 18, "良"],
        [20, 73, 102, 182, 2.787, 44, 19, "良"],
        [21, 73, 50, 76, 0.717, 31, 20, "良"],
        [22, 84, 94, 140, 2.238, 68, 18, "良"],
        [23, 93, 77, 104, 1.165, 53, 7, "良"],
        [24, 99, 130, 227, 3.97, 55, 15, "良"],
        [25, 146, 84, 139, 1.094, 40, 17, "轻度污染"],
        [26, 113, 108, 137, 1.481, 48, 15, "轻度污染"],
        [27, 81, 48, 62, 1.619, 26, 3, "良"],
        [28, 56, 48, 68, 1.336, 37, 9, "良"],
        [29, 82, 92, 174, 3.29, 0, 13, "良"],
        [30, 106, 116, 188, 3.628, 101, 16, "轻度污染"],
        [31, 118, 50, 0, 1.383, 76, 11, "轻度污染"]
    ];

    var dataSH = [
        [1, 91, 45, 125, 0.82, 34, 23, "良"],
        [2, 65, 27, 78, 0.86, 45, 29, "良"],
        [3, 83, 60, 84, 1.09, 73, 27, "良"],
        [4, 109, 81, 121, 1.28, 68, 51, "轻度污染"],
        [5, 106, 77, 114, 1.07, 55, 51, "轻度污染"],
        [6, 109, 81, 121, 1.28, 68, 51, "轻度污染"],
        [7, 106, 77, 114, 1.07, 55, 51, "轻度污染"],
        [8, 89, 65, 78, 0.86, 51, 26, "良"],
        [9, 53, 33, 47, 0.64, 50, 17, "良"],
        [10, 80, 55, 80, 1.01, 75, 24, "良"],
        [11, 117, 81, 124, 1.03, 45, 24, "轻度污染"],
        [12, 99, 71, 142, 1.1, 62, 42, "良"],
        [13, 95, 69, 130, 1.28, 74, 50, "良"],
        [14, 116, 87, 131, 1.47, 84, 40, "轻度污染"],
        [15, 108, 80, 121, 1.3, 85, 37, "轻度污染"],
        [16, 134, 83, 167, 1.16, 57, 43, "轻度污染"],
        [17, 79, 43, 107, 1.05, 59, 37, "良"],
        [18, 71, 46, 89, 0.86, 64, 25, "良"],
        [19, 97, 71, 113, 1.17, 88, 31, "良"],
        [20, 84, 57, 91, 0.85, 55, 31, "良"],
        [21, 87, 63, 101, 0.9, 56, 41, "良"],
        [22, 104, 77, 119, 1.09, 73, 48, "轻度污染"],
        [23, 87, 62, 100, 1, 72, 28, "良"],
        [24, 168, 128, 172, 1.49, 97, 56, "中度污染"],
        [25, 65, 45, 51, 0.74, 39, 17, "良"],
        [26, 39, 24, 38, 0.61, 47, 17, "优"],
        [27, 39, 24, 39, 0.59, 50, 19, "优"],
        [28, 93, 68, 96, 1.05, 79, 29, "良"],
        [29, 188, 143, 197, 1.66, 99, 51, "中度污染"],
        [30, 174, 131, 174, 1.55, 108, 50, "中度污染"],
        [31, 187, 143, 201, 1.39, 89, 53, "中度污染"]
    ];

    var schema = [
        {name: 'date', index: 0, text: '日期'},
        {name: 'AQIindex', index: 1, text: 'AQI'},
        {name: 'PM25', index: 2, text: 'PM2.5'},
        {name: 'PM10', index: 3, text: 'PM10'},
        {name: 'CO', index: 4, text: ' CO'},
        {name: 'NO2', index: 5, text: 'NO2'},
        {name: 'SO2', index: 6, text: 'SO2'},
        {name: '等级', index: 7, text: '等级'}
    ];

    var lineStyle = {
        normal: {
            width: 1,
            opacity: 0.5
        }
    };

    return {
        backgroundColor: '#333',
        legend: {
            bottom: 30,
            data: ['北京', '上海', '广州'],
            itemGap: 20,
            textStyle: {
                color: '#fff',
                fontSize: 14
            }
        },
        tooltip: {
            padding: 10,
            backgroundColor: '#222',
            borderColor: '#777',
            borderWidth: 1,
            formatter: function (obj) {
                var value = obj[0].value;
                return '<div style="border-bottom: 1px solid rgba(255,255,255,.3); font-size: 18px;' +
                    'padding-bottom: 7px;margin-bottom: 7px">'
                    + obj[0].seriesName + ' ' + value[0] + '日期：'
                    + value[7]
                    + '</div>'
                    + schema[1].text + '：' + value[1] + '<br>'
                    + schema[2].text + '：' + value[2] + '<br>'
                    + schema[3].text + '：' + value[3] + '<br>'
                    + schema[4].text + '：' + value[4] + '<br>'
                    + schema[5].text + '：' + value[5] + '<br>'
                    + schema[6].text + '：' + value[6] + '<br>';
            }
        },
        // dataZoom: {
        //     show: true,
        //     orient: 'vertical',
        //     parallelAxisIndex: [0]
        // },
        parallelAxis: [
            {dim: 0, name: schema[0].text, inverse: true, max: 31, nameLocation: 'start'},
            {dim: 1, name: schema[1].text},
            {dim: 2, name: schema[2].text},
            {dim: 3, name: schema[3].text},
            {dim: 4, name: schema[4].text},
            {dim: 5, name: schema[5].text},
            {dim: 6, name: schema[6].text},
            {
                dim: 7, name: schema[7].text,
                type: 'category', data: ['优', '良', '轻度污染', '中度污染', '重度污染', '严重污染']
            }
        ],
        visualMap: {
            show: true,
            min: 0,
            max: 150,
            dimension: 2,
            inRange: {
                color: ['#d94e5d', '#eac736', '#50a3ba'].reverse(),
                // colorAlpha: [0, 1]
            }
        },
        parallel: {
            left: '5%',
            right: '18%',
            bottom: 100,
            parallelAxisDefault: {
                type: 'value',
                name: 'AQI指数',
                nameLocation: 'end',
                nameGap: 20,
                nameTextStyle: {
                    color: '#fff',
                    fontSize: 12
                },
                axisLine: {
                    lineStyle: {
                        color: '#aaa'
                    }
                },
                axisTick: {
                    lineStyle: {
                        color: '#777'
                    }
                },
                splitLine: {
                    show: false
                },
                axisLabel: {
                    textStyle: {
                        color: '#fff'
                    }
                }
            }
        },
        series: [
            {
                name: '北京',
                type: 'parallel',
                lineStyle: lineStyle,
                data: dataBJ
            },
            {
                name: '上海',
                type: 'parallel',
                lineStyle: lineStyle,
                data: dataSH
            },
            {
                name: '广州',
                type: 'parallel',
                lineStyle: lineStyle,
                data: dataGZ
            }
        ]
    };
}

export function getFunnelOption() {
    return {
        title: {
            text: '漏斗图',
            subtext: '纯属虚构'
        },
        tooltip: {
            trigger: 'item',
            formatter: "{a} <br/>{b} : {c}%"
        },
        toolbox: {
            feature: {
                dataView: {readOnly: false},
                restore: {},
                saveAsImage: {}
            }
        },
        legend: {
            data: ['展现', '点击', '访问', '咨询', '订单']
        },
        calculable: true,
        series: [
            {
                name: '漏斗图',
                type: 'funnel',
                left: '10%',
                top: 60,
                //x2: 80,
                bottom: 60,
                width: '80%',
                // height: {totalHeight} - y - y2,
                min: 0,
                max: 100,
                minSize: '0%',
                maxSize: '100%',
                sort: 'descending',
                gap: 2,
                label: {
                    normal: {
                        show: true,
                        position: 'inside'
                    },
                    emphasis: {
                        textStyle: {
                            fontSize: 20
                        }
                    }
                },
                labelLine: {
                    normal: {
                        length: 10,
                        lineStyle: {
                            width: 1,
                            type: 'solid'
                        }
                    }
                },
                itemStyle: {
                    normal: {
                        borderColor: '#fff',
                        borderWidth: 1
                    }
                },
                data: [
                    {value: 60, name: '访问'},
                    {value: 40, name: '咨询'},
                    {value: 20, name: '订单'},
                    {value: 80, name: '点击'},
                    {value: 100, name: '展现'}
                ]
            }
        ]
    };
}

export function getGaugeOption() {
    return {
        tooltip: {
            formatter: "{a} <br/>{b} : {c}%"
        },
        series: [
            {
                name: '业务指标',
                type: 'gauge',
                detail: {formatter: '{value}%'},
                data: [{value: 50, name: '完成率'}]
            }
        ]
    }
}

export function getCalendarOption() {
    var dateList = [
        ['2017-1-1', '初四'],
        ['2017-1-2', '初五'],
        ['2017-1-3', '初六'],
        ['2017-1-4', '初七'],
        ['2017-1-5', '初八', '小寒'],
        ['2017-1-6', '初九'],
        ['2017-1-7', '初十'],
        ['2017-1-8', '十一'],
        ['2017-1-9', '十二'],
        ['2017-1-10', '十三'],
        ['2017-1-11', '十四'],
        ['2017-1-12', '十五'],
        ['2017-1-13', '十六'],
        ['2017-1-14', '十七'],
        ['2017-1-15', '十八'],
        ['2017-1-16', '十九'],
        ['2017-1-17', '二十'],
        ['2017-1-18', '廿一'],
        ['2017-1-19', '廿二'],
        ['2017-1-20', '廿三', '大寒'],
        ['2017-1-21', '廿四'],
        ['2017-1-22', '廿五'],
        ['2017-1-23', '廿六'],
        ['2017-1-24', '廿七'],
        ['2017-1-25', '廿八'],
        ['2017-1-26', '廿九'],
        ['2017-1-27', '三十'],
        ['2017-1-28', '正月'],
        ['2017-1-29', '初二'],
        ['2017-1-30', '初三'],
        ['2017-1-31', '初四'],
        ['2017-2-1', '初五'],
        ['2017-2-2', '初六'],
        ['2017-2-3', '初七', '立春'],
        ['2017-2-4', '初八'],
        ['2017-2-5', '初九'],
        ['2017-2-6', '初十'],
        ['2017-2-7', '十一'],
        ['2017-2-8', '十二'],
        ['2017-2-9', '十三'],
        ['2017-2-10', '十四'],
        ['2017-2-11', '十五'],
        ['2017-2-12', '十六'],
        ['2017-2-13', '十七'],
        ['2017-2-14', '十八'],
        ['2017-2-15', '十九'],
        ['2017-2-16', '二十'],
        ['2017-2-17', '廿一'],
        ['2017-2-18', '廿二', '雨水'],
        ['2017-2-19', '廿三'],
        ['2017-2-20', '廿四'],
        ['2017-2-21', '廿五'],
        ['2017-2-22', '廿六'],
        ['2017-2-23', '廿七'],
        ['2017-2-24', '廿八'],
        ['2017-2-25', '廿九'],
        ['2017-2-26', '二月'],
        ['2017-2-27', '初二'],
        ['2017-2-28', '初三'],
        ['2017-3-1', '初四'],
        ['2017-3-2', '初五'],
        ['2017-3-3', '初六'],
        ['2017-3-4', '初七'],
        ['2017-3-5', '初八', '驚蟄'],
        ['2017-3-6', '初九'],
        ['2017-3-7', '初十'],
        ['2017-3-8', '十一'],
        ['2017-3-9', '十二'],
        ['2017-3-10', '十三'],
        ['2017-3-11', '十四'],
        ['2017-3-12', '十五'],
        ['2017-3-13', '十六'],
        ['2017-3-14', '十七'],
        ['2017-3-15', '十八'],
        ['2017-3-16', '十九'],
        ['2017-3-17', '二十'],
        ['2017-3-18', '廿一'],
        ['2017-3-19', '廿二'],
        ['2017-3-20', '廿三', '春分'],
        ['2017-3-21', '廿四'],
        ['2017-3-22', '廿五'],
        ['2017-3-23', '廿六'],
        ['2017-3-24', '廿七'],
        ['2017-3-25', '廿八'],
        ['2017-3-26', '廿九'],
        ['2017-3-27', '三十'],
        ['2017-3-28', '三月'],
        ['2017-3-29', '初二'],
        ['2017-3-30', '初三'],
        ['2017-3-31', '初四'],
        ['2017-4-1', '初五'],
        ['2017-4-2', '初六'],
        ['2017-4-3', '初七'],
        ['2017-4-4', '初八', '清明'],
        ['2017-4-5', '初九'],
        ['2017-4-6', '初十'],
        ['2017-4-7', '十一'],
        ['2017-4-8', '十二'],
        ['2017-4-9', '十三'],
        ['2017-4-10', '十四'],
        ['2017-4-11', '十五'],
        ['2017-4-12', '十六'],
        ['2017-4-13', '十七'],
        ['2017-4-14', '十八'],
        ['2017-4-15', '十九'],
        ['2017-4-16', '二十'],
        ['2017-4-17', '廿一'],
        ['2017-4-18', '廿二'],
        ['2017-4-19', '廿三'],
        ['2017-4-20', '廿四', '穀雨'],
        ['2017-4-21', '廿五'],
        ['2017-4-22', '廿六'],
        ['2017-4-23', '廿七'],
        ['2017-4-24', '廿八'],
        ['2017-4-25', '廿九'],
        ['2017-4-26', '四月'],
        ['2017-4-27', '初二'],
        ['2017-4-28', '初三'],
        ['2017-4-29', '初四'],
        ['2017-4-30', '初五'],
        ['2017-5-1', '初六'],
        ['2017-5-2', '初七'],
        ['2017-5-3', '初八'],
        ['2017-5-4', '初九'],
        ['2017-5-5', '初十', '立夏'],
        ['2017-5-6', '十一'],
        ['2017-5-7', '十二'],
        ['2017-5-8', '十三'],
        ['2017-5-9', '十四'],
        ['2017-5-10', '十五'],
        ['2017-5-11', '十六'],
        ['2017-5-12', '十七'],
        ['2017-5-13', '十八'],
        ['2017-5-14', '十九'],
        ['2017-5-15', '二十'],
        ['2017-5-16', '廿一'],
        ['2017-5-17', '廿二'],
        ['2017-5-18', '廿三'],
        ['2017-5-19', '廿四'],
        ['2017-5-20', '廿五'],
        ['2017-5-21', '廿六', '小滿'],
        ['2017-5-22', '廿七'],
        ['2017-5-23', '廿八'],
        ['2017-5-24', '廿九'],
        ['2017-5-25', '三十'],
        ['2017-5-26', '五月'],
        ['2017-5-27', '初二'],
        ['2017-5-28', '初三'],
        ['2017-5-29', '初四'],
        ['2017-5-30', '初五'],
        ['2017-5-31', '初六'],
        ['2017-6-1', '初七'],
        ['2017-6-2', '初八'],
        ['2017-6-3', '初九'],
        ['2017-6-4', '初十'],
        ['2017-6-5', '十一', '芒種'],
        ['2017-6-6', '十二'],
        ['2017-6-7', '十三'],
        ['2017-6-8', '十四'],
        ['2017-6-9', '十五'],
        ['2017-6-10', '十六'],
        ['2017-6-11', '十七'],
        ['2017-6-12', '十八'],
        ['2017-6-13', '十九'],
        ['2017-6-14', '二十'],
        ['2017-6-15', '廿一'],
        ['2017-6-16', '廿二'],
        ['2017-6-17', '廿三'],
        ['2017-6-18', '廿四'],
        ['2017-6-19', '廿五'],
        ['2017-6-20', '廿六'],
        ['2017-6-21', '廿七', '夏至'],
        ['2017-6-22', '廿八'],
        ['2017-6-23', '廿九'],
        ['2017-6-24', '六月'],
        ['2017-6-25', '初二'],
        ['2017-6-26', '初三'],
        ['2017-6-27', '初四'],
        ['2017-6-28', '初五'],
        ['2017-6-29', '初六'],
        ['2017-6-30', '初七'],
        ['2017-7-1', '初八'],
        ['2017-7-2', '初九'],
        ['2017-7-3', '初十'],
        ['2017-7-4', '十一'],
        ['2017-7-5', '十二'],
        ['2017-7-6', '十三'],
        ['2017-7-7', '十四', '小暑'],
        ['2017-7-8', '十五'],
        ['2017-7-9', '十六'],
        ['2017-7-10', '十七'],
        ['2017-7-11', '十八'],
        ['2017-7-12', '十九'],
        ['2017-7-13', '二十'],
        ['2017-7-14', '廿一'],
        ['2017-7-15', '廿二'],
        ['2017-7-16', '廿三'],
        ['2017-7-17', '廿四'],
        ['2017-7-18', '廿五'],
        ['2017-7-19', '廿六'],
        ['2017-7-20', '廿七'],
        ['2017-7-21', '廿八'],
        ['2017-7-22', '廿九', '大暑'],
        ['2017-7-23', '閏六',],
        ['2017-7-24', '初二'],
        ['2017-7-25', '初三'],
        ['2017-7-26', '初四'],
        ['2017-7-27', '初五'],
        ['2017-7-28', '初六'],
        ['2017-7-29', '初七'],
        ['2017-7-30', '初八'],
        ['2017-7-31', '初九'],
        ['2017-8-1', '初十'],
        ['2017-8-2', '十一'],
        ['2017-8-3', '十二'],
        ['2017-8-4', '十三'],
        ['2017-8-5', '十四'],
        ['2017-8-6', '十五'],
        ['2017-8-7', '十六', '立秋'],
        ['2017-8-8', '十七'],
        ['2017-8-9', '十八'],
        ['2017-8-10', '十九'],
        ['2017-8-11', '二十'],
        ['2017-8-12', '廿一'],
        ['2017-8-13', '廿二'],
        ['2017-8-14', '廿三'],
        ['2017-8-15', '廿四'],
        ['2017-8-16', '廿五'],
        ['2017-8-17', '廿六'],
        ['2017-8-18', '廿七'],
        ['2017-8-19', '廿八'],
        ['2017-8-20', '廿九'],
        ['2017-8-21', '三十'],
        ['2017-8-22', '七月'],
        ['2017-8-23', '初二', '處暑'],
        ['2017-8-24', '初三'],
        ['2017-8-25', '初四'],
        ['2017-8-26', '初五'],
        ['2017-8-27', '初六'],
        ['2017-8-28', '初七'],
        ['2017-8-29', '初八'],
        ['2017-8-30', '初九'],
        ['2017-8-31', '初十'],
        ['2017-9-1', '十一'],
        ['2017-9-2', '十二'],
        ['2017-9-3', '十三'],
        ['2017-9-4', '十四'],
        ['2017-9-5', '十五'],
        ['2017-9-6', '十六'],
        ['2017-9-7', '十七', '白露'],
        ['2017-9-8', '十八'],
        ['2017-9-9', '十九'],
        ['2017-9-10', '二十'],
        ['2017-9-11', '廿一'],
        ['2017-9-12', '廿二'],
        ['2017-9-13', '廿三'],
        ['2017-9-14', '廿四'],
        ['2017-9-15', '廿五'],
        ['2017-9-16', '廿六'],
        ['2017-9-17', '廿七'],
        ['2017-9-18', '廿八'],
        ['2017-9-19', '廿九'],
        ['2017-9-20', '八月'],
        ['2017-9-21', '初二'],
        ['2017-9-22', '初三'],
        ['2017-9-23', '初四', '秋分'],
        ['2017-9-24', '初五'],
        ['2017-9-25', '初六'],
        ['2017-9-26', '初七'],
        ['2017-9-27', '初八'],
        ['2017-9-28', '初九'],
        ['2017-9-29', '初十'],
        ['2017-9-30', '十一'],
        ['2017-10-1', '十二'],
        ['2017-10-2', '十三'],
        ['2017-10-3', '十四'],
        ['2017-10-4', '十五'],
        ['2017-10-5', '十六'],
        ['2017-10-6', '十七'],
        ['2017-10-7', '十八'],
        ['2017-10-8', '十九', '寒露'],
        ['2017-10-9', '二十'],
        ['2017-10-10', '廿一'],
        ['2017-10-11', '廿二'],
        ['2017-10-12', '廿三'],
        ['2017-10-13', '廿四'],
        ['2017-10-14', '廿五'],
        ['2017-10-15', '廿六'],
        ['2017-10-16', '廿七'],
        ['2017-10-17', '廿八'],
        ['2017-10-18', '廿九'],
        ['2017-10-19', '三十'],
        ['2017-10-20', '九月'],
        ['2017-10-21', '初二'],
        ['2017-10-22', '初三'],
        ['2017-10-23', '初四', '霜降'],
        ['2017-10-24', '初五'],
        ['2017-10-25', '初六'],
        ['2017-10-26', '初七'],
        ['2017-10-27', '初八'],
        ['2017-10-28', '初九'],
        ['2017-10-29', '初十'],
        ['2017-10-30', '十一'],
        ['2017-10-31', '十二'],
        ['2017-11-1', '十三'],
        ['2017-11-2', '十四'],
        ['2017-11-3', '十五'],
        ['2017-11-4', '十六'],
        ['2017-11-5', '十七'],
        ['2017-11-6', '十八'],
        ['2017-11-7', '十九', '立冬'],
        ['2017-11-8', '二十'],
        ['2017-11-9', '廿一'],
        ['2017-11-10', '廿二'],
        ['2017-11-11', '廿三'],
        ['2017-11-12', '廿四'],
        ['2017-11-13', '廿五'],
        ['2017-11-14', '廿六'],
        ['2017-11-15', '廿七'],
        ['2017-11-16', '廿八'],
        ['2017-11-17', '廿九'],
        ['2017-11-18', '十月'],
        ['2017-11-19', '初二'],
        ['2017-11-20', '初三'],
        ['2017-11-21', '初四'],
        ['2017-11-22', '初五', '小雪'],
        ['2017-11-23', '初六'],
        ['2017-11-24', '初七'],
        ['2017-11-25', '初八'],
        ['2017-11-26', '初九'],
        ['2017-11-27', '初十'],
        ['2017-11-28', '十一'],
        ['2017-11-29', '十二'],
        ['2017-11-30', '十三'],
        ['2017-12-1', '十四'],
        ['2017-12-2', '十五'],
        ['2017-12-3', '十六'],
        ['2017-12-4', '十七'],
        ['2017-12-5', '十八'],
        ['2017-12-6', '十九'],
        ['2017-12-7', '二十', '大雪'],
        ['2017-12-8', '廿一'],
        ['2017-12-9', '廿二'],
        ['2017-12-10', '廿三'],
        ['2017-12-11', '廿四'],
        ['2017-12-12', '廿五'],
        ['2017-12-13', '廿六'],
        ['2017-12-14', '廿七'],
        ['2017-12-15', '廿八'],
        ['2017-12-16', '廿九'],
        ['2017-12-17', '三十'],
        ['2017-12-18', '十一月',],
        ['2017-12-19', '初二'],
        ['2017-12-20', '初三'],
        ['2017-12-21', '初四'],
        ['2017-12-22', '初五', '冬至'],
        ['2017-12-23', '初六'],
        ['2017-12-24', '初七'],
        ['2017-12-25', '初八'],
        ['2017-12-26', '初九'],
        ['2017-12-27', '初十'],
        ['2017-12-28', '十一'],
        ['2017-12-29', '十二'],
        ['2017-12-30', '十三'],
        ['2017-12-31', '十四']
    ];

    var heatmapData = [];
    var lunarData = [];
    for (var i = 0; i < dateList.length; i++) {
        heatmapData.push([
            dateList[i][0],
            Math.random() * 300
        ]);
        lunarData.push([
            dateList[i][0],
            1,
            dateList[i][1],
            dateList[i][2]
        ]);
    }

    return {
        tooltip: {
            formatter: function (params) {
                return '降雨量: ' + params.value[1].toFixed(2);
            }
        },

        visualMap: {
            show: false,
            min: 0,
            max: 300,
            calculable: true,
            seriesIndex: [2],
            orient: 'horizontal',
            left: 'center',
            bottom: 20,
            inRange: {
                color: ['#e0ffff', '#006edd'],
                opacity: 0.3
            },
            controller: {
                inRange: {
                    opacity: 0.5
                }
            }
        },

        calendar: [{
            left: 'center',
            top: 'middle',
            cellSize: [70, 70],
            yearLabel: {show: false},
            orient: 'vertical',
            dayLabel: {
                firstDay: 1,
                nameMap: 'cn'
            },
            monthLabel: {
                show: false
            },
            range: '2017-03'
        }],

        series: [{
            type: 'scatter',
            coordinateSystem: 'calendar',
            symbolSize: 1,
            label: {
                normal: {
                    show: true,
                    formatter: function (params) {
                        var d = echarts.number.parseDate(params.value[0]);
                        return d.getDate() + '\n\n' + params.value[2] + '\n\n';
                    },
                    textStyle: {
                        color: '#000'
                    }
                }
            },
            data: lunarData
        }, {
            type: 'scatter',
            coordinateSystem: 'calendar',
            symbolSize: 1,
            label: {
                normal: {
                    show: true,
                    formatter: function (params) {
                        return '\n\n\n' + (params.value[3] || '');
                    },
                    textStyle: {
                        fontSize: 14,
                        fontWeight: 700,
                        color: '#a00'
                    }
                }
            },
            data: lunarData
        }, {
            name: '降雨量',
            type: 'heatmap',
            coordinateSystem: 'calendar',
            data: heatmapData
        }]
    };
}